Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
mes (InputLayer)                [(None, 1)]          0                                            
__________________________________________________________________________________________________
pais_origen_destino (InputLayer [(None, 1)]          0                                            
__________________________________________________________________________________________________
contribuyente (InputLayer)      [(None, 1)]          0                                            
__________________________________________________________________________________________________
aduana (InputLayer)             [(None, 1)]          0                                            
__________________________________________________________________________________________________
anno (InputLayer)               [(None, 1)]          0                                            
__________________________________________________________________________________________________
inciso_arancelario (InputLayer) [(None, 1)]          0                                            
__________________________________________________________________________________________________
Embedding_mes (Embedding)       (None, 1, 6)         78          mes[0][0]                        
__________________________________________________________________________________________________
Embedding_pais_origen_destino ( (None, 1, 28)        4536        pais_origen_destino[0][0]        
__________________________________________________________________________________________________
Embedding_contribuyente (Embedd (None, 1, 349)       5237792     contribuyente[0][0]              
__________________________________________________________________________________________________
Embedding_aduana (Embedding)    (None, 1, 13)        598         aduana[0][0]                     
__________________________________________________________________________________________________
Embedding_anno (Embedding)      (None, 1, 6)         66          anno[0][0]                       
__________________________________________________________________________________________________
Embedding_inciso_arancelario (E (None, 1, 208)       1243632     inciso_arancelario[0][0]         
__________________________________________________________________________________________________
Flatten_mes (Flatten)           (None, 6)            0           Embedding_mes[0][0]              
__________________________________________________________________________________________________
Flatten_pais_origen_destino (Fl (None, 28)           0           Embedding_pais_origen_destino[0][
__________________________________________________________________________________________________
Flatten_contribuyente (Flatten) (None, 349)          0           Embedding_contribuyente[0][0]    
__________________________________________________________________________________________________
Flatten_aduana (Flatten)        (None, 13)           0           Embedding_aduana[0][0]           
__________________________________________________________________________________________________
Flatten_anno (Flatten)          (None, 6)            0           Embedding_anno[0][0]             
__________________________________________________________________________________________________
Flatten_inciso_arancelario (Fla (None, 208)          0           Embedding_inciso_arancelario[0][0
__________________________________________________________________________________________________
cif (InputLayer)                [(None, 1)]          0                                            
__________________________________________________________________________________________________
cuantia (InputLayer)            [(None, 1)]          0                                            
__________________________________________________________________________________________________
peso_bruto (InputLayer)         [(None, 1)]          0                                            
__________________________________________________________________________________________________
impuesto_total (InputLayer)     [(None, 1)]          0                                            
__________________________________________________________________________________________________
combined (Concatenate)          (None, 614)          0           Flatten_mes[0][0]                
                                                                 Flatten_pais_origen_destino[0][0]
                                                                 Flatten_contribuyente[0][0]      
                                                                 Flatten_aduana[0][0]             
                                                                 Flatten_anno[0][0]               
                                                                 Flatten_inciso_arancelario[0][0] 
                                                                 cif[0][0]                        
                                                                 cuantia[0][0]                    
                                                                 peso_bruto[0][0]                 
                                                                 impuesto_total[0][0]             
__________________________________________________________________________________________________
dense (Dense)                   (None, 128)          78720       combined[0][0]                   
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 128)          512         dense[0][0]                      
__________________________________________________________________________________________________
dropout (Dropout)               (None, 128)          0           batch_normalization[0][0]        
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 56)           7224        dropout[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 56)           224         dense_1[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 56)           0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 28)           1596        dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 28)           112         dense_2[0][0]                    
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 28)           0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1)            29          dropout_2[0][0]                  
==================================================================================================
Total params: 6,575,119
Trainable params: 6,574,695
Non-trainable params: 424
__________________________________________________________________________________________________
