Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
anno (InputLayer)               [(None, 1)]          0                                            
__________________________________________________________________________________________________
mes (InputLayer)                [(None, 1)]          0                                            
__________________________________________________________________________________________________
aduana (InputLayer)             [(None, 1)]          0                                            
__________________________________________________________________________________________________
pais_origen_destino (InputLayer [(None, 1)]          0                                            
__________________________________________________________________________________________________
contribuyente (InputLayer)      [(None, 1)]          0                                            
__________________________________________________________________________________________________
inciso_arancelario (InputLayer) [(None, 1)]          0                                            
__________________________________________________________________________________________________
Embedding_anno (Embedding)      (None, 1, 6)         66          anno[0][0]                       
__________________________________________________________________________________________________
Embedding_mes (Embedding)       (None, 1, 6)         78          mes[0][0]                        
__________________________________________________________________________________________________
Embedding_aduana (Embedding)    (None, 1, 13)        585         aduana[0][0]                     
__________________________________________________________________________________________________
Embedding_pais_origen_destino ( (None, 1, 23)        2668        pais_origen_destino[0][0]        
__________________________________________________________________________________________________
Embedding_contribuyente (Embedd (None, 1, 252)       2119068     contribuyente[0][0]              
__________________________________________________________________________________________________
Embedding_inciso_arancelario (E (None, 1, 172)       729624      inciso_arancelario[0][0]         
__________________________________________________________________________________________________
Flatten_anno (Flatten)          (None, 6)            0           Embedding_anno[0][0]             
__________________________________________________________________________________________________
Flatten_mes (Flatten)           (None, 6)            0           Embedding_mes[0][0]              
__________________________________________________________________________________________________
Flatten_aduana (Flatten)        (None, 13)           0           Embedding_aduana[0][0]           
__________________________________________________________________________________________________
Flatten_pais_origen_destino (Fl (None, 23)           0           Embedding_pais_origen_destino[0][
__________________________________________________________________________________________________
Flatten_contribuyente (Flatten) (None, 252)          0           Embedding_contribuyente[0][0]    
__________________________________________________________________________________________________
Flatten_inciso_arancelario (Fla (None, 172)          0           Embedding_inciso_arancelario[0][0
__________________________________________________________________________________________________
cif (InputLayer)                [(None, 1)]          0                                            
__________________________________________________________________________________________________
cuantia (InputLayer)            [(None, 1)]          0                                            
__________________________________________________________________________________________________
peso_bruto (InputLayer)         [(None, 1)]          0                                            
__________________________________________________________________________________________________
impuesto_total (InputLayer)     [(None, 1)]          0                                            
__________________________________________________________________________________________________
combined (Concatenate)          (None, 476)          0           Flatten_anno[0][0]               
                                                                 Flatten_mes[0][0]                
                                                                 Flatten_aduana[0][0]             
                                                                 Flatten_pais_origen_destino[0][0]
                                                                 Flatten_contribuyente[0][0]      
                                                                 Flatten_inciso_arancelario[0][0] 
                                                                 cif[0][0]                        
                                                                 cuantia[0][0]                    
                                                                 peso_bruto[0][0]                 
                                                                 impuesto_total[0][0]             
__________________________________________________________________________________________________
dense (Dense)                   (None, 256)          122112      combined[0][0]                   
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 256)          1024        dense[0][0]                      
__________________________________________________________________________________________________
dropout (Dropout)               (None, 256)          0           batch_normalization[0][0]        
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 128)          32896       dropout[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 128)          512         dense_1[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 128)          0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 50)           6450        dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 50)           200         dense_2[0][0]                    
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 50)           0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1)            51          dropout_2[0][0]                  
==================================================================================================
Total params: 3,015,334
Trainable params: 3,014,466
Non-trainable params: 868
__________________________________________________________________________________________________
