Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
contribuyente (InputLayer)      [(None, 1)]          0                                            
__________________________________________________________________________________________________
mes (InputLayer)                [(None, 1)]          0                                            
__________________________________________________________________________________________________
pais_origen_destino (InputLayer [(None, 1)]          0                                            
__________________________________________________________________________________________________
anno (InputLayer)               [(None, 1)]          0                                            
__________________________________________________________________________________________________
inciso_arancelario (InputLayer) [(None, 1)]          0                                            
__________________________________________________________________________________________________
aduana (InputLayer)             [(None, 1)]          0                                            
__________________________________________________________________________________________________
Embedding_contribuyente (Embedd (None, 1, 391)       7190099     contribuyente[0][0]              
__________________________________________________________________________________________________
Embedding_mes (Embedding)       (None, 1, 6)         78          mes[0][0]                        
__________________________________________________________________________________________________
Embedding_pais_origen_destino ( (None, 1, 29)        5017        pais_origen_destino[0][0]        
__________________________________________________________________________________________________
Embedding_anno (Embedding)      (None, 1, 6)         66          anno[0][0]                       
__________________________________________________________________________________________________
Embedding_inciso_arancelario (E (None, 1, 220)       1442540     inciso_arancelario[0][0]         
__________________________________________________________________________________________________
Embedding_aduana (Embedding)    (None, 1, 13)        598         aduana[0][0]                     
__________________________________________________________________________________________________
Flatten_contribuyente (Flatten) (None, 391)          0           Embedding_contribuyente[0][0]    
__________________________________________________________________________________________________
Flatten_mes (Flatten)           (None, 6)            0           Embedding_mes[0][0]              
__________________________________________________________________________________________________
Flatten_pais_origen_destino (Fl (None, 29)           0           Embedding_pais_origen_destino[0][
__________________________________________________________________________________________________
Flatten_anno (Flatten)          (None, 6)            0           Embedding_anno[0][0]             
__________________________________________________________________________________________________
Flatten_inciso_arancelario (Fla (None, 220)          0           Embedding_inciso_arancelario[0][0
__________________________________________________________________________________________________
Flatten_aduana (Flatten)        (None, 13)           0           Embedding_aduana[0][0]           
__________________________________________________________________________________________________
cif (InputLayer)                [(None, 1)]          0                                            
__________________________________________________________________________________________________
cuantia (InputLayer)            [(None, 1)]          0                                            
__________________________________________________________________________________________________
peso_bruto (InputLayer)         [(None, 1)]          0                                            
__________________________________________________________________________________________________
impuesto_total (InputLayer)     [(None, 1)]          0                                            
__________________________________________________________________________________________________
combined (Concatenate)          (None, 669)          0           Flatten_contribuyente[0][0]      
                                                                 Flatten_mes[0][0]                
                                                                 Flatten_pais_origen_destino[0][0]
                                                                 Flatten_anno[0][0]               
                                                                 Flatten_inciso_arancelario[0][0] 
                                                                 Flatten_aduana[0][0]             
                                                                 cif[0][0]                        
                                                                 cuantia[0][0]                    
                                                                 peso_bruto[0][0]                 
                                                                 impuesto_total[0][0]             
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         686080      combined[0][0]                   
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 1024)         4096        dense[0][0]                      
__________________________________________________________________________________________________
dropout (Dropout)               (None, 1024)         0           batch_normalization[0][0]        
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 256)          262400      dropout[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 256)          1024        dense_1[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 256)          0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 128)          32896       dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 128)          512         dense_2[0][0]                    
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 128)          0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1)            129         dropout_2[0][0]                  
==================================================================================================
Total params: 9,625,535
Trainable params: 9,622,719
Non-trainable params: 2,816
__________________________________________________________________________________________________
